app/controllers/tasks_controller.rb

  def index
    respond_with (@tasks = Task.all)
---
SELECT "tasks".* FROM "tasks"

  def create
    newTaskDesc = params[:desc]
    newTaskDue = params[:due]
    binding.pry
    @task = Task.new
    @task.desc = newTaskDesc
    @task.due = newTaskDue
    @task.save
---
INSERT INTO "tasks" ("created_at", "desc", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-14 03:59:10.130386"], ["desc", "laundry"], ["updated_at", "2014-09-14 03:59:10.130386"]]

  def update
    respond_with @task.update(task_params)
---
UPDATE "tasks" SET "desc" = $1, "updated_at" = $2 WHERE "tasks"."id" = 25  [["desc", "This is annoying"], ["updated_at", "2014-09-15 04:10:19.386551"]]

  def destroy
    respond_with @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]